{"word":"-sa","pos":"suffix","senses":[{"glosses":["Denotes conditional mood in sentences within a conditional sub-clause."],"tags":["morpheme"],"examples":[{"text":"Parası olsa, düşünmeden alır.","translation":"If he had money, he would buy it without thinking."},{"text":"Sabah erken kalksa, okula geç kalmaz.","translation":"If she got up early in the morning, she wouldn't be late to school."},{"text":"Birine sorsak daha kolay bulabiliriz.","translation":"We could find it more easily if we asked someone."},{"text":"Beğense de beğenmese de, bu onun görevi.","translation":"Whether he likes it or not, this is his duty."}]},{"glosses":["Denotes optative mood to the main verb in simple sentences; can be used with modals."],"tags":["morpheme"],"examples":[{"text":"Ah, benim de senin kadar zamanım olsa.","translation":"Ugh, I wish I had as much time as you."},{"text":"Yarın sen de bizimle gelsen.","translation":"(Why don't you) Come with us tomorrow."},{"text":"Keşke artık okula dönebilsem, arkadaşlarımı çok özledim.","translation":"I wish I could go back to school, I miss my friends a lot."},{"text":"İnsanlar el ele tutuşsa. Birlik olsa. Uzansak sonsuza.","translation":"If only people held hands. If only they united. If only we could reach eternity."},{"text":"Keşke erken yatmak zorunda olmasak.","translation":"If only we didn't have to go to bed early."}]},{"glosses":["The sub-clause formed with the optative mood can act as the subject of the verb."],"tags":["morpheme"],"examples":[{"text":"Sen de bizimle gelsen olmaz mı?","translation":"Wouldn't it be good if you came with us, too?"},{"text":"Bu öneriye ne kadar itiraz etsen yeridir.","translation":"You couldn't object to this proposal enough."}]},{"glosses":["Conditional and optative moods can be used with past moods of the copula to form complex verbs."],"tags":["morpheme"],"examples":[{"text":"Daha çok çalışsaydık kazanırdık.","translation":"If we had practiced more, we would have won."},{"text":"Keşke o son baklavayı yemeseydim.","translation":"I wish I hadn't eaten that last baklava."}]},{"glosses":["The optative mood can denote a reprimanding tone with past moods of the copula in colloquial usage."],"tags":["morpheme"],"examples":[{"text":"İyi bir üniversite kazanmak istiyordun madem, daha çok çalışsaydın.","translation":"Well, if you wanted to enter a good university, you should have studied more."},{"text":"Ne yapayım, babasını dinleseymiş de satmasaymış arabasını.","translation":"What shall I do, he should have listened to his father and not sell his car."}]},{"glosses":["Denotes conditional mood of the copula, affixed to nouns or noun-based words to turn them into verbs; can be written separately as the \"ise\" conjunction with personal inflections affixed onto the conjunction. If it is affixed to a word that ends in a vowel, \"y\" acts as buffer consonant in between."],"tags":["morpheme"],"examples":[{"text":"İnsansan (İnsan isen) çöpünü buraya atma!","translation":"If you are a human being, don't throw your garbage here!"},{"text":"Çok pahalıysa (pahalı ise), almam.","translation":"I won't buy it if it's too expensive."},{"text":"Eğer şanslıysanız (şanslı iseniz), hayatınızı \"öncesi\" ve \"sonrası\" olarak ayırabilecek biriyle tanışırsınız.","translation":"If you're lucky, you'll meet someone that can divide your life into \"before\" and \"after.\""},{"text":"Hava soğuksa (soğuk ise) dışarı çıkmayalım.","translation":"If the weather is cold, let's not go outside."}]},{"glosses":["In the negative form of the above structure, the suffix is affixed to the negation particle."],"tags":["morpheme"],"examples":[{"text":"Hava soğuk değilse (soğuk değil ise) dışarı çıkalım.","translation":"If the weather is not cold, let's go outside."}]},{"glosses":["The conditional mood of the copula can be used to denote contrast or introducing a new idea that follows from the first; can be written separately as the \"ise\" conjunction."],"tags":["morpheme"],"examples":[{"text":"Ben gitar çalarım, kız kardeşimse (kız kardeşim ise) piyano çalar.","translation":"I play the guitar, whereas my sister plays the piano."},{"text":"Tansiyonu yüksek, ateşiyse (ateşi ise) normalin üstünde.","translation":"Her blood pressure is high, (and) her temperature is above normal."}]},{"glosses":["Time conjunctions and modals can be used with the conditional mood of the copula to form complex verbs; can be written separately as the \"ise\" conjunction, however it is rarely used in modern Turkish."],"tags":["morpheme"],"examples":[{"text":"Babam işten erken gelirse, sinemaya gidebiliriz.","translation":"We can go to the movies if dad comes home early."},{"text":"Kopyalama işlemi bitmişse, sürücüyü çıkarabilirsiniz.","translation":"You may remove the driver, if the copying process has ended."},{"text":"Bu kağıtları kullanmayacaksan çöpe atacağım.","translation":"If you're not going to use these papers, I'll throw them away."},{"text":"Kişiyi mutluluk öldürebilirse, benim çoktan ölmem gerekirdi!","translation":"If happiness could kill a person, I would have died long ago!"}]},{"glosses":["Forms a compound imperative structure in colloquial usage with the interjection \"a\" (complies with vowel harmony), denoting an insistent request or command. In the 3rd person, the interjection \"ya\" replaces it and is written separately."],"tags":["morpheme"],"examples":[{"text":"ye- (“to eat”) + -se + -n → yesen (Con/Opt mood 2nd Sg.) + a (interj.) → Yesene!","translation":"“Go ahead, eat!”"},{"text":"bak- (“to look”) + -ma + -sa + -nız → bakmasanız (Con/Opt mood 2nd Pl. neg.) + a (interj.) → Bakmasanıza!","translation":"“Stop looking!”"},{"text":"Bu akşam bize gelsenize!","translation":"(Why don't you) Come to our place tonight!"},{"text":"Annesine ev işlerinde yardım etse ya!","translation":"Why doesn't he help his mother with the house chores!"}]},{"glosses":["Repeating of the verb with the suffix forms an adverbial phrase denoting a certainty for the action to be fulfilled in a particular way or by a particular person."],"tags":["morpheme"],"examples":[{"text":"Bu açıdan atsa atsa Alex gol atar.","translation":"Only Alex could score a goal from this angle."},{"text":"Bizim mesele çözülse çözülse mahkemede çözülür.","translation":"Our affair could only be resolved at court."}]},{"glosses":["Forms sub-clauses with question words, denoting an expansion or generalization of the scope of the verb. Depending on the question word, the sub-clause can act as the subject, object or adverbial phrase in the sentence."],"tags":["morpheme"],"examples":[{"text":"Elimi neye atsam bozuluyor.","translation":"Whatever I touch breaks."},{"text":"Kim olsa bu şartlara isyan ederdi.","translation":"Anybody would protest these conditions."},{"text":"Kimi görsem sen sanıyorum.","translation":"Whomever I see I think is you."},{"text":"Buraya ne zaman gelsem eski günleri hatırlarım.","translation":"I remember the old days whenever I come here."},{"text":"Nereye gitse elinde mutlaka bir kitap olur.","translation":"Wherever she goes, she always has a book in her hands."}]},{"glosses":["Forms formulaic adverbs with certain question words."],"tags":["morpheme"],"examples":[{"text":"ne (“what”) + -(y)se → neyse (“whatever, anyways”)"},{"text":"nasıl (“how”) + -sa → nasılsa (“somehow, someway”)"},{"text":"nerede (“where”) + -(y)se → neredeyse (“almost, nearly, before long”)"},{"text":"neden (“why”) + -se → nedense (“for some reason”)"},{"text":"niye (“why”) + -(y)se → niyeyse (“for some reason”)"}]},{"glosses":["Forms an indefinite pronoun with the question word \"kim\"."],"tags":["morpheme"],"examples":[{"text":"kim (“who”) + -se → kimse (“anybody, nobody”)"}]}],"pronunciation":"/sa/","etymology":"From Ottoman Turkish ـسه (-sa, -se), from Old Turkic *-sar, from Proto-Turkic *-sar or *-sa, where the \"r\" was gradually omitted over time. Cognate with Old Uyghur *-sar."}